"""
Практическая работа 8 — Решение технологической задачи
Три экскаватора роют котлован объёмом a м³ при запасе топлива c л.
  Мощный:  22.5 м³/ч,  10 л/ч
  Средний: 10   м³/ч,   b л/ч
  Малый:    5   м³/ч,   2 л/ч

Переменные x1, x2, x3 — часы работы каждого экскаватора.

Задание 1: минимизировать время выполнения работы T
Задание 2: минимизировать расход топлива при выполнении работы
"""

import os
import sys
from fractions import Fraction
from scipy.optimize import linprog

# ─── Таблица вариантов ────────────────────────────────────────────────────────
VARIANTS = {
    1:  {"a": 1350, "b": Fraction(10, 3), "c": 548},
    2:  {"a": 1080, "b": Fraction(4),     "c": 460},
    3:  {"a": 1080, "b": Fraction(11, 3), "c": 444},
    4:  {"a": 1440, "b": Fraction(10, 3), "c": 580},
    5:  {"a": 1140, "b": Fraction(4),     "c": 480},
    6:  {"a": 1350, "b": Fraction(11, 3), "c": 552},
    7:  {"a": 1620, "b": Fraction(10, 3), "c": 656},
    8:  {"a": 2160, "b": Fraction(11, 3), "c": 888},
    9:  {"a": 1200, "b": Fraction(4),     "c": 500},
    10: {"a": 1320, "b": Fraction(4),     "c": 550},
    11: {"a": 1890, "b": Fraction(11, 3), "c": 777},
    12: {"a": 1200, "b": Fraction(4),     "c": 510},
    13: {"a": 1800, "b": Fraction(10, 3), "c": 728},
    14: {"a": 1380, "b": Fraction(4),     "c": 580},
    15: {"a": 1620, "b": Fraction(11, 3), "c": 666},
}

# ─── Выбор варианта ───────────────────────────────────────────────────────────
try:
    VARIANT_NUMBER = int(input("Введите номер варианта (1–15): "))
except ValueError:
    print("Ошибка: введите целое число.")
    sys.exit(1)

# ─── Вывод (консоль + файл) ───────────────────────────────────────────────────
OUTPUT_DIR = os.path.join("../../output", "eightPractice")
os.makedirs(OUTPUT_DIR, exist_ok=True)
OUTPUT_FILE = os.path.join(OUTPUT_DIR, f"Practice_8_N{VARIANT_NUMBER}.txt")

lines = []

def out(text=""):
    """Печатает строку в консоль и сохраняет для файла."""
    print(text)
    lines.append(text)

# ─── Получаем параметры варианта ─────────────────────────────────────────────
if VARIANT_NUMBER not in VARIANTS:
    print(f"Вариант {VARIANT_NUMBER} не существует. Доступны: 1–15.")
    sys.exit(1)

params = VARIANTS[VARIANT_NUMBER]
a = params["a"]
b = float(params["b"])
c = params["c"]
b_frac = params["b"]      # для красивого вывода

# ─── Шапка ───────────────────────────────────────────────────────────────────
print()
out("=" * 60)
out("  Практическая работа 8 — Решение технологической задачи")
out(f"  Вариант {VARIANT_NUMBER}")
out("=" * 60)
out()
out("Исходные данные:")
out(f"  a = {a} м³   (объём котлована)")
out(f"  b = {b_frac} л/ч  (расход топлива среднего экскаватора)")
out(f"  c = {c} л    (запас топлива)")
out()
out("Экскаваторы:")
out("  Мощный  (x1): производительность 22.5 м³/ч, расход 10  л/ч")
out(f"  Средний (x2): производительность 10   м³/ч, расход {b_frac} л/ч")
out("  Малый   (x3): производительность  5   м³/ч, расход  2  л/ч")
out()

# ─── Постановка задачи ────────────────────────────────────────────────────────
out("─" * 60)
out("ПОСТАНОВКА ЗАДАЧИ")
out("─" * 60)
out()
out("Переменные:")
out("  x1, x2, x3 — часы работы мощного, среднего и малого")
out("               экскаваторов соответственно.")
out()
out("Ограничения (общие для обоих заданий):")
out(f"  (1) 22.5·x1 + 10·x2 + 5·x3 >= {a}   (объём должен быть выполнен)")
out(f"  (2) 10·x1 + {b_frac}·x2 + 2·x3 <= {c}       (не превысить запас топлива)")
out("  (3) x1, x2, x3 >= 0")
out()

# ═══════════════════════════════════════════════════════════════════════════════
# ЗАДАНИЕ 1 — минимизировать время T
# Переменные: [T, x1, x2, x3]
# Цель: min T
# xi <= T  →  xi - T <= 0
# ═══════════════════════════════════════════════════════════════════════════════
out("─" * 60)
out("ЗАДАНИЕ 1 — Выполнить работу как можно скорее")
out("─" * 60)
out()
out("Целевая функция:")
out("  T → min   (T — продолжительность работ в часах)")
out()
out("Дополнительные ограничения:")
out("  x1 <= T,  x2 <= T,  x3 <= T")
out("  (каждый экскаватор работает не дольше общего времени)")
out()

#  переменные: [T, x1, x2, x3]
c_obj1 = [1, 0, 0, 0]

A_ub1 = [
    [0, -22.5, -10,  -5  ],   # -объём <= -a
    [0,  10,    b,    2  ],   # топливо <= c
    [-1,  1,    0,    0  ],   # x1 - T <= 0
    [-1,  0,    1,    0  ],   # x2 - T <= 0
    [-1,  0,    0,    1  ],   # x3 - T <= 0
]
b_ub1 = [-a, c, 0, 0, 0]

bounds1 = [(0, None)] * 4    # T, x1, x2, x3 >= 0

res1 = linprog(c_obj1, A_ub=A_ub1, b_ub=b_ub1, bounds=bounds1, method="highs")

if res1.success:
    T_opt   = res1.x[0]
    x1_opt  = res1.x[1]
    x2_opt  = res1.x[2]
    x3_opt  = res1.x[3]

    fuel_used = 10 * x1_opt + b * x2_opt + 2 * x3_opt
    vol_done  = 22.5 * x1_opt + 10 * x2_opt + 5 * x3_opt

    out("Результат:")
    out(f"  Минимальное время T = {T_opt:.4f} ч  ({T_opt*60:.1f} мин)")
    out(f"  x1 (мощный)  = {x1_opt:.4f} ч")
    out(f"  x2 (средний) = {x2_opt:.4f} ч")
    out(f"  x3 (малый)   = {x3_opt:.4f} ч")
    out()
    out("Проверка:")
    out(f"  Объём выполнен:  {vol_done:.2f} м³  (требуется >= {a})")
    out(f"  Топливо израсходовано: {fuel_used:.2f} л  (запас {c} л)")
else:
    out(f"  Задача не имеет решения: {res1.message}")

out()

# ═══════════════════════════════════════════════════════════════════════════════
# ЗАДАНИЕ 2 — минимизировать расход топлива
# Переменные: [x1, x2, x3]
# Цель: min  10·x1 + b·x2 + 2·x3
# ═══════════════════════════════════════════════════════════════════════════════
out("─" * 60)
out("ЗАДАНИЕ 2 — Максимальная экономия топлива")
out("─" * 60)
out()
out("Целевая функция:")
out(f"  10·x1 + {b_frac}·x2 + 2·x3 → min")
out()

c_obj2 = [10, b, 2]

A_ub2 = [
    [-22.5, -10, -5],   # объём
    [ 10,    b,   2],   # топливо
]
b_ub2 = [-a, c]

bounds2 = [(0, None)] * 3

res2 = linprog(c_obj2, A_ub=A_ub2, b_ub=b_ub2, bounds=bounds2, method="highs")

if res2.success:
    x1_opt2 = res2.x[0]
    x2_opt2 = res2.x[1]
    x3_opt2 = res2.x[2]

    fuel_min  = 10 * x1_opt2 + b * x2_opt2 + 2 * x3_opt2
    vol_done2 = 22.5 * x1_opt2 + 10 * x2_opt2 + 5 * x3_opt2
    time2     = max(x1_opt2, x2_opt2, x3_opt2)

    out("Результат:")
    out(f"  Минимальный расход топлива = {fuel_min:.4f} л")
    out(f"  x1 (мощный)  = {x1_opt2:.4f} ч")
    out(f"  x2 (средний) = {x2_opt2:.4f} ч")
    out(f"  x3 (малый)   = {x3_opt2:.4f} ч")
    out()
    out("Проверка:")
    out(f"  Объём выполнен:  {vol_done2:.2f} м³  (требуется >= {a})")
    out(f"  Топливо израсходовано: {fuel_min:.2f} л  (запас {c} л)")
    out(f"  Время работ (по наибольшему xi): {time2:.4f} ч  ({time2*60:.1f} мин)")
else:
    out(f"  Задача не имеет решения: {res2.message}")

out()
out("=" * 60)
out("ИТОГ")
out("=" * 60)
if res1.success and res2.success:
    out(f"  Задание 1 (мин. время):   T = {T_opt:.4f} ч,  топливо = {fuel_used:.2f} л")
    out(f"  Задание 2 (мин. топливо): топливо = {fuel_min:.4f} л,  время ≈ {time2:.4f} ч")

# ─── Запись в файл ────────────────────────────────────────────────────────────
with open(OUTPUT_FILE, "w", encoding="utf-8") as f:
    f.write("\n".join(lines) + "\n")

print(f"\n[Файл сохранён: {OUTPUT_FILE}]")